<template>
  <div class="vo">
    <div class="container-rule">
      <h3 class="rule-title">胚豆用户协议</h3>
      <div
        class="cv"
      >本协议是用户（以下简称“您”）以及所有者及其关联公司（以下简称为“胚豆”或“本站”）之间就胚豆网站服务等相关事宜所订立的契约，请您仔细阅读本注册协议，您选择”同意条款”完成注册，即视为您接受并同意遵守本协议的约定。胚豆会根据法律法规及其他情况变化在必要时修改服务条款或规则，胚豆服务条款一旦发生变动，请用户及时关注和了解该变动。如果您对本协议的修改有异议，或对胚豆网的服务不满，您可以行使如下权利：停止使用胚豆网的网络服务；或，通过客服等渠道告知胚豆网停止对其服务。结束服务后，用户使用胚豆网络服务的权利立即终止。在此情况下，胚豆网没有义务传送任何信息或服务给用户或任何无直接关系的第三方。</div>
      <div class="cv">
        <p class="x-title">一.服务条款确认</p>
        <span
          class="x-content"
        >1.本站的各项电子服务的所有权和运作权归胚豆所有。您同意所有注册协议条款并完成注册程序，才能成为本站的正式用户。您确认：本协议条款是处理双方权利义务的依据，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定或约定。</span>
        <span
          class="x-content"
        >2. 您点击同意本协议的，即视为您确认自己具有享受本站服务、进行服务预约、缴纳定金、购买胚豆券等相应的权利能力和行为能力，能够独立承担法律责任</span>
        <span class="x-content">3.您确认，如果您在18周岁以下，您只能在父母或其他监护人的监护参与下才能使用本站。</span>
        <span
          class="x-content"
        >4.胚豆保留在中华人民共和国大陆地区施行之法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容或取消预约的权利。胚豆网有权行使修改或中断服务的权利，不需对用户或任何无直接关系的第三方负责。</span>
        <span
          class="x-content"
        >5.您使用本站提供的服务时，应同时接受适用于本站特定服务、活动等的准则、条款和协议（以下统称为“其他条款”）；如果以下使用条件与“其他条款”有不一致之处，则以“其他条款”为准。</span>
        
        <span class="x-content">6.为表述便利，本站的各类服务、活动等简称为“服务”。</span>
      </div>
      <div class="cv">
        <p class="x-title">二、本站服务</p>
        <span
          class="x-content"
        >1.胚豆服务说明：胚豆是将有资质的医疗美容机构提供的医疗美容服务信息及医疗美容机构、医生、接受医疗美容服务的消费者所分享的经验、体会等信息汇集于互联网平台供用户查阅的互联网信息服务提供商，同时帮助用户通过互联网与上述医疗美容机构联系并预订相关医疗美容服务项目。胚豆并不提供具体的医疗美容服务，对于涉及医疗美容的具体服务将由有资质的服务商（医疗美容机构）提供。对用户预订的服务项目中出现的瑕疵等问题，胚豆并不承担责任，但胚豆将尽力协助用户与相关医疗美容服务项目提供商进行协商，不能协商解决的，用户可以向消费者协会投诉或通过法律途径解决。胚豆通过互联网依法为您提供互联网信息等服务，您在完全同意本协议及本站相关规定的情况下，方有权使用本站的相关服务。。</span>
        <span
          class="x-content"
        >2.您必须自行准备如下设备和承担如下开支：（1）上网设备，包括并不限于电脑或者其他上网终端、调制解调器及其他必备的上网装置；（2）上网开支，包括并不限于网络接入费、上网设备租用费、手机流量费等。</span>
      </div>
      <div class="cv">
        <p class="x-title">三、用户信息收集及保护</p>

        <span
          class="x-content"
        >1.您应自行诚信向本站提供注册资料，您保证提供的注册资料真实、准确、完整、合法有效，您的注册资料如有变动的，应及时更新其注册资料。如果您提供的注册资料不合法、不真实、不准确、不详尽的，您需承担因此引起的相应责任及后果，并且胚豆保留单方终止您使用胚豆各项服务的权利。</span>
        <span
          class="x-content"
        >2.您在本站进行注册、浏览、预定服务商提供的服务、评价、参加活动等行为时，涉及您真实姓名/名称、通信地址、联系电话、电子邮箱、预定订单详情、评价或反馈、投诉内容、cookies等信息的，本站有权从完成交易、客户服务、开展活动、完成良好的客户体验等多种角度予以收集，并将对其中涉及个人隐私信息予以严格保密，除非得到您的授权、为履行强行性法律义务（如国家安全机关指令）或法律另有规定、本注册协议或其他条款另有约定外，本站不会向外界披露您的隐私信息。</span>
        <span
          class="x-content"
        >3.您注册成功后，将产生用户名和密码等账户信息，您可以根据本站规定更改您的密码和设定昵称。您应谨慎合理的保存、使用您的账户信息。您若发现任何非法使用您的账户或其他存在安全漏洞的情况的，请立即通知本站并向公安机关报案。</span>
        <span
          class="x-content"
        >4.您同意，胚豆拥有通过邮件、短信、电话、网站通知或声明等形式，向在本站注册、参与活动的用户、收货人发送服务信息、各项活动、客户服务等告知信息的权利。如您不希望接收上述信息，可退订。</span>
        <span
          class="x-content"
        >5.您同意：您通过本站向本站的服务提供商（以下统称为“服务商”）提交预定或预约服务的，视为您向服务商披露个人相关信息，接受服务商向您提供客户服务、处理信用卡付款、数据分析、市场营销帮助或其他必要事宜；如前述全部或部分事宜之一涉及由服务商外的第三方履行的，服务商有权将您的信息以必要方式向第三方披露，第三方有权以履行上述事宜为目的联系您。</span>
        <span class="x-content">6.您不得将在本站注册获得的账号、密码等账户信息提供给他人使用，否则您应承担由此产生的全部责任，并与实际使用人承担连带责任。></span>
        <span
          class="x-content"
        >7.您同意，胚豆有权使用您的注册信息、用户名、密码等信息，登陆进入您的注册账户，进行证据保全，包括但不限于公证、见证、协助司法机关进行调查取证等。</span>
      </div>

      <div class="cv">
        <p class="x-title">四、用户履行的义务</p>
        <span>本协议依据国家相关法律法规规章制定，您同意严格遵守以下义务：</span>
        <span
          class="x-content"
        >1.不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；</span>
        <span class="x-content">2.从中国大陆向境外传输资料信息时必须符合中国有关法律法规；</span>
        <span class="x-content">3.不得利用本站从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；</span>
        <span class="x-content">4.不得干扰本站的正常运转，不得侵入本站及国家计算机信息系统；</span>
        <span class="x-content">5.不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、不文明的等信息资料；</span>
        <span class="x-content">6.不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；</span>
        <span class="x-content">7.不得教唆他人从事本条所禁止的行为；</span>
        <span class="x-content">
          8.除本注册协议、其他条款或另有其他约定外，您不得利用在本站注册的账户进行经营活动、牟利行为及其他未经本站许可的行为，包括但不限于以下行为
          <span
            class="x-content"
          >①您账户内的任何胚豆优惠信息（包括但不限于胚豆券、预约券及其他形式优惠或折扣等）由胚豆享有解释权和修改权，您仅享有在选择在胚豆进行服务信息发布的医疗服务机构服务时的使用权，严禁转卖胚豆账户、胚豆券、预约券或其他类型的优惠券、卡、或利用胚豆账户进行其他经营性行为等；</span>
          <span class="x-content">②通过任何手段恶意注册胚豆网站帐号，包括但不限于以牟利、炒作、套现、获奖等为目的多个账号注册。用户亦不得盗用其他用户帐号。</span>
          <span class="x-content">③发布广告、垃圾邮件；</span>
          <span
            class="x-content"
          >④需维护胚豆的客观、真实性，不得利用胚豆网用户身份进行违反诚信的任何行为，包括但不限于：炒作医院或医生，并向医院或医生收取费用或获取利益；为获得利益或好处，参与或组织撰写及发布虚假信息；进行其他影响社区真实性、客观性、干扰扰乱网站正常秩序的违规行为等；</span>
          <span
            class="x-content"
          >⑤任何对本站服务商信息、服务内容、其他用户信息或其他内容的下载、转载、收集、衍生利用、复制、出售、转售或其他形式的使用，无论是否通过Robots、Spiders、自动仪器或手工操作；</span>
          <span class="x-content">⑥本站相关规则、政策、或网页活动规则中限制、禁止的行为；</span>
          <span
            class="x-content"
          >⑦将胚豆网以任何形式作为从事各种非法活动的场所、平台或媒介。未经胚豆网的授权或许可，用户不得借用本站的名义从事任何商业活动，也不得以任何形式将胚豆网作为从事商业活动的场所、平台或媒介；</span>
          <span class="x-content">⑧其他影响胚豆对用户账户正常管理秩序的行为。</span>
        </span>
        <span
          class="x-content"
        >9您不得利用任何非法手段获取其他用户个人信息，不得将其他用户信息用于任何营利或非营利目的，不得泄露其他用户或权利人的个人隐私，否则胚豆有权采取本协议规定的合理措施制止您的上述行为，情节严重的，将提交公安机关进行刑事立案。</span>
        <span
          class="x-content"
        >10.您不得发布任何侵犯他人著作权、商标权等知识产权或其他合法权利（如肖像权、隐私权）的内容；如果有其他用户或权利人发现您发布的信息涉嫌知识产权、或其他合法权益争议的，这些用户或权利人有权要求胚豆删除您发布的信息，或者采取其他必要措施予以制止，胚豆将会依法采取这些措施。</span>
        <span class="x-content">11.您应不时关注并遵守本站不时公布或修改的各类规则规定。本站保有删除站内各类不符合法律政策或不真实的信息内容而无须通知您的权利。</span>
        <span
          class="x-content"
        >12.若您未遵守以上规定的，则胚豆网有权直接采取一切必要的措施，包括但不限于删除用户发布的内容、取消用户在网站获得的氧分、荣誉等，暂停或查封用户帐号，取消因违规所获利益，乃至通过诉讼形式追究用户法律责任等。您须对自己在网上的言论和行为承担法律责任。</span>
        <span
          class="x-content"
        >13.您一旦接受本协议，即认可在“胚豆网相关平台”中所上传的包含您肖像及隐私部位的照片，可由胚豆用于相关平台的推广宣传及营销等合法并以营利为目的的商业用途。其前述所指的“胚豆网相关平台”，包括但不限于手机端APP、腾讯或新浪微博推广及微信公众平台推送等。该类照片不得用于其他非胚豆医美平台或色情、反动的媒体和违犯中国法律法规的宣传或宣传品之上。同时该肖像权的使用授权为无期限及无附加条件的使用。如您认为胚豆在某类宣传推广平台上对您上述照片使用产生了不当影响，您可通过胚豆网官方客服电话或者论坛内投诉维权渠道要求胚豆对其进行处理，胚豆会根据您的要求进行合理性、合法性判断，并与之进行相应处理。</span>
        <span
          class="x-content"
        >14.您同意并已充分了解本协议的条款，承诺不将已发表于本站的信息，以任何形式发布或授权其他主体以任何方式使用（包括但限于在各类网站、媒体上使用）。</span>
      </div>

      <div class="cv">
        <p class="x-title">五、用户享受的权利</p>

        <span class="x-content">
          1.用户的用户名、密码和安全性
          <span
            class="x-content"
          >①用户可自行创建、修改昵称，您名和昵称的命名及使用应遵守相关法律法规并符合网络道德。您名和昵称中不能含有任何侮辱、威胁、淫秽、谩骂等侵害他人合法权益的文字。</span>
          <span
            class="x-content"
          >②您一旦注册成功，将得到您名和密码，并对以此组您名和密码登入系统后所发生的所有活动和事件负责，自行承担一切使用该您名的言语、行为等而直接或者间接导致的法律责任。</span>
          <span class="x-content">③您有义务妥善保管胚豆账号、账户和密码，您将对账户和密码安全负全部责任。因您原因导致您名或密码泄露而造成的任何法律后果由您本人负责。</span>
          <span class="x-content">④您密码遗失的，可以通过手机重置密码。您若发现任何非法使用您名或存在其他安全漏洞的情况，应立即告知胚豆网。</span>
          <span class="x-content">⑤原则上，您仅可以注册一个账户，对于您恶意超出数量注册的账户，胚豆网有权予以封闭，造成的任何损失或责任，应由您自行承担。</span>
          <span class="x-content">⑥您不得冒充他人注册本网站，也不得盗用他人帐号，如有该行为，造成的任何法律责任将由您自行承担。</span>
        </span>
        <span class="x-content">2.您有权在注册并登陆后对站内医院发布客观、真实、亲身体验的胚豆信息和图片；</span>
        <span class="x-content">3.您有权根据网站相关规定，在发布胚豆信息等贡献后，取得胚豆网给予的奖励（如豆芽等）；</span>
        <span class="x-content">4.您有权修改其个人账户中各项可修改信息，自行选择昵称和录入介绍性文字，自行决定是否提供非必填项的内容；</span>
        <span class="x-content">5.您有权参加胚豆秀场社区，并发表符合国家法律规定，并符合胚豆网社区规则的文章及观点；</span>
        <span class="x-content">6.您有权参加胚豆网组织提供的各项线上、线下活动；</span>
        <span class="x-content">7.您有权根据胚豆网网站规定，享受胚豆网提供的其它各类服务。</span>
      </div>
      <div class="cv">
        <p class="x-title">六、责任限制及不承诺担保</p>
        <span
          class="x-content"
        >1.除非另有明确的书面说明,本站及其所包含的或以其他方式通过本站提供给您的全部信息、内容、材料、产品（包括软件）和服务，均是在“按现状”和“按现有”的基础上提供的。</span>
        <span
          class="x-content"
        >2.除非另有明确的书面说明,胚豆不对本站的运营及其包含在本站上的信息、内容、材料、产品（包括软件）或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。</span>
        <span
          class="x-content"
        >3.胚豆不担保本站所包含的或以其他方式通过本站提供给您的全部信息、内容、材料、产品（包括软件）和服务、其服务器或从本站发出的电子信件、信息没有病毒或其他有害成分。</span>
        <span
          class="x-content"
        >4.如因不可抗力或其他本站无法控制的原因使本站系统崩溃或无法正常使用导致网上交易无法完成或丢失有关的信息、记录等，胚豆会合理地尽力协助处理善后事宜。</span>
        <span
          class="x-content"
        >5.您应对账户信息及密码承担保密责任，因您未能尽到信息安全和保密责任而致使您的账户发生任何问题的，您应承担全部责任。同时，因网络环境存在众多不可预知因素，因您自身终端网络原因（包括但不限于断网、黑客攻击、病毒等）造成您的账户或个人信息等被第三方窃取的，胚豆不承担赔偿责任。</span>
        <span
          class="x-content"
        >6.您了解并同意，胚豆有权应国家有关机关的要求，向其提供您在胚豆的用户信息和交易记录等必要信息。如您涉嫌侵犯他人合法权益，则胚豆有权在初步判断涉嫌侵权行为可能存在的情况下，向权利人提供您必要的个人信息。</span>
        <span class="x-content">7.胚豆或许会在胚豆网中提供链接胚豆网以外的网站上。请参考该网站对于用户隐私权保护的相关条款，胚豆网将不为其他网站的隐私权保护规定负责。</span>
      </div>
      <div class="cv">
        <p class="x-title">七、免责条款：</p>
        <span
          class="x-content"
        >1.虽然胚豆网已将所有信息和资料进行过认真编辑与审查，但是仍然可能存在错误或不准确的信息。本网站不保证以下各项：信息和资料中包含的功能将不受干扰或没有错误；信息和资料将符合用户的特定要求；缺陷将被纠正；本网站或提供本网站的服务器没有病毒或其它有害成分；通过本网站传送的讯息将能维持保密。就本网站中信息和资料的正确性、准确性、可靠性或其它方面而言，胚豆概不对本网站中的信息和资料的使用或使用后果做出任何保证。</span>
        <span
          class="x-content"
        >2.对于因病毒、系统缺陷、人对计算机系统的作为或不作为、电话线、硬件、软件、程序出错或其它由于使用本网站而引起的计算机传输或网络连接错误、失败或延迟造成的损害，本网站也不承担责任，即便这些损害是由于用户登陆或使用本网站。胚豆不保证本网站的使用是持续的、不中断的或安全的。</span>
        <span class="x-content">3.由于您的的保管疏忽导致帐号、密码遭他人非法使用。胚豆不承担任何法律责任。</span>
        <span
          class="x-content"
        >4.胚豆对本网站任何可能含有的第三方网站的内容、隐私权政策或操作不享有控制权，亦不承担任何责任。此外，胚豆亦无法审查或编辑任何第三方网站的相关内容。胚豆概不负责因您使用本网站上连接的第三方网站所产生的任何全部责任。因此，我们希望您留意自己何时离开本网站并阅读您所访问的任一其他网站的使用条款与隐私权政策。</span>
      </div>
      <div class="cv">
        <p class="x-title">八、其他</p>
        <span class="x-content">1.胚豆网站所有者是指在政府部门依法许可或备案的胚豆网站经营主体。</span>
        <span
          class="x-content"
        >2.胚豆尊重您的合法权利，本协议及本站上发布的各类规则、声明、政策等其他内容，均是为了更好的、更加便利的为您提供服务。本站欢迎您和社会各界提出意见和建议，胚豆将虚心接受并适时修改本协议及本站上的各类规则。</span>
        <span class="x-content">3.如果您是本网站的注册用户，本协议条款将对您持续有效，有效期至您注销或者被关闭账户后，但用户人身性及知识产权相关条款在此后继续有效。</span>
      </div>
    </div>
  </div>
</template>

<script>
export default {};
</script>

<style scoped lang="less">
@import url("../style/style.less");

.container-rule {
  font-size: @baseSize*2;
  color: @baseTextColor-c;
  padding: @basePadding*2;
  background-color: @base-white;
  line-height: 22px * 2;

  & > .rule-title {
    font-size: 16px * 2;
    font-weight: bold;
    color: @baseFirstTitleColor;
    margin-bottom: 30px * 2;
  }

  & > .cv {
    margin-bottom: 15px * 2;

    & .x-title {
      font-weight: bold;
      color: @baseFirstTitleColor;
      margin-bottom: 15px * 2;
    }
    & .x-content {
      display: block;
    }
  }

  & .hv {
    margin-left: 10px * 2;
    font-weight: normal;
    color: @baseTextColor-c;
  }
}
</style>
